In [3]:
import pandas as pd
import sqlite3

In [4]:
connection = sqlite3.connect("../data/survey.db")

In [5]:
cursor = connection.cursor()

In [6]:
cursor.execute("SELECT * from Site;")

In [7]:
results = cursor.fetchall()

In [8]:
results

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [10]:
pd.DataFrame(results)

       0      1       2
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [13]:
cursor.close()
connection.close()

In [14]:
connection = sqlite3.connect("../data/survey.db")
df = pd.read_sql_query("SELECT * from Site;", connection)
df

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [ ]:
#df.to_sql('tbl_name', connection, if_exists='replace')